Revit 2024 API
EndTreatmentType.EndTreatment Property
 String describing the end treatment
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string EndTreatment { get; set; }
Visual Basic
Public Property EndTreatment As String
	Get
	Set
Visual C++
public:
property String^ EndTreatment {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
EndTreatmentType Class
Autodesk.Revit.DB.Structure Namespace